eisup_2019_docmng_integration/src/Documents/абс_ИзменениеКонтрагентаВДоговоре/абс_ИзменениеКонтрагентаВДоговоре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ИзменениеКонтрагентаВДоговоре</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыИзмененияКонтрагентаВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаДолга</name>
    <type>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйДоговор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВестиПоДокументамРасчетов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВзаиморасчетыУпр</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОплаты</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
        <types>DocumentRef.абс_СчетНаОплату</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВзаиморасчетыРегл</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОплаты</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИсторияСтатусовИзменениеКонтрагентаВДоговоре/абс_ИсторияСтатусовИзменениеКонтрагентаВДоговоре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИсторияСтатусовИзменениеКонтрагентаВДоговоре</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.абс_ИзменениеКонтрагентаВДоговоре</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыИзмененияКонтрагентаВДоговоре</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации/РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации</name>
  <comment>(Регл)</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРег</name>
    <comment>Сумма в валюте регламентированного учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <comment>Незакрытый документ поставки/оплаты</comment>
    <type>
      <types>DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АккредитивПереданный</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ИнкассовоеПоручениеПолученное</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетОплаты</name>
    <comment>Счет бухгалтерского учета, по которому производится оплата</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОплаты</name>
    <comment>Дата возникновения аванса</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыИзмененияКонтрагентаВДоговоре/абс_СтатусыИзмененияКонтрагентаВДоговоре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыИзмененияКонтрагентаВДоговоре</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтерои</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ИзменениеКонтрагентаВДоговоре/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мСтатус = Объект.Статус;
	мСтарыйСтатус = Объект.Статус;
	ЭтоНовый = Параметры.Ключ.Пустая();
	ЗаполнитьСписокДоступныхСтатусов();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если мСтарыйСтатус <> Объект.Статус ИЛИ ЭтоНовый Тогда
		СтрокаПричиныИзмененияСтатуса = "";
		
		Если НЕ ЭтоНовый Тогда
			СтрокаПричиныИзмененияСтатуса = "";
		Иначе	
			СтрокаПричиныИзмененияСтатуса = "Ввод нового документа";
		КонецЕсли;
		
		
		мСтарыйСтатус = Объект.Статус;	
		ЭтоНовый = Ложь;
		
		ЗаписатьСтатусВРегистр(Объект.Ссылка, Объект.Статус, СтрокаПричиныИзмененияСтатуса);
		
	КонецЕсли;
	
	ЗаполнитьСписокДоступныхСтатусов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Статус = Перечисления.абс_СтатусыИзмененияКонтрагентаВДоговоре.Завершен Тогда 	
		Для Каждого элемент Из Элементы Цикл 
			
			Если НЕ (элемент.Имя = "ГруппаШапка" ИЛИ элемент.Имя = "ГруппаШапкаПравая" ИЛИ  элемент.Имя = "Статус" 
				ИЛИ ТипЗнч(элемент) = тип("КнопкаКоманднойПанели") ИЛИ ТипЗнч(элемент) = тип("КнопкаФормы")) Тогда
				элемент.ТолькоПросмотр = Истина;
			КонецЕсли;
			
			//Если ТипЗнч(элемент) = тип("КнопкаКоманднойПанели") Тогда
			//	Если элемент.Имя = "ЗаполнитьОстаткиПоВзаиморасчетам" Тогда
			//		элемент.Доступность = Ложь;
			//	КонецЕсли;
			//КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ


&НаКлиенте
Процедура СписокДоговоровПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.СписокДоговоров.ТекущиеДанные;
	ОчиститьСтрокиВзаиорасчетовПоДоговору(ТекущиеДанные.Договор);

КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровДоговорОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокДоговоров.ТекущиеДанные;
	ОчиститьСтрокиВзаиорасчетовПоДоговору(ТекущиеДанные.Договор);
	УстановитьОтборПоДоговору(ТекущиеДанные.Договор);

КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровДоговорОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда 
		ТекущиеДанные = Элементы.СписокДоговоров.ТекущиеДанные;
		ОчиститьСтрокиВзаиорасчетовПоДоговору(ТекущиеДанные.Договор);
		УстановитьОтборПоДоговору(ТекущиеДанные.Договор);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если (Объект.Контрагент <> ВыбранноеЗначение) И (ЗначениеЗаполнено(Объект.Контрагент)) И (Объект.СписокДоговоров.Количество() > 0) Тогда 	
		
		Ответ = Вопрос("Изменился ранее выбранный контрагент, таблица договоров будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			ВыбранноеЗначение = Объект.Контрагент;
			Возврат;
		КонецЕсли; 
	
		Объект.СписокДоговоров.Очистить();
		Объект.ВзаиморасчетыУпр.Очистить();
		Объект.ВзаиморасчетыРегл.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.СписокДоговоров.ТекущиеДанные;
	
	Если (ТекущиеДанные.Договор <> ВыбранноеЗначение) И ЗначениеЗаполнено(ТекущиеДанные.Договор) Тогда 		
		ОчиститьСтрокиВзаиорасчетовПоДоговору(ТекущиеДанные.Договор)		
	КонецЕсли;
	
	УстановитьОтборПоДоговору(ТекущиеДанные.Договор);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
		
	Если (мСтатус = Перечисления.абс_СтатусыИзмененияКонтрагентаВДоговоре.Завершен) И (мСтарыйСтатус <> мСтатус) Тогда
		Если НЕ ПроверитьАктуальностьЗаполненияВзаиморасчетовНаСервере() Тогда
			мСтатус = Объект.Статус;
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не совпаают остатки по взаиморасчетам с данными документа. Перезаполните остатки по взаиморасчетам по кнопке ""Заполнить остатки по взаиморасчетам""");	
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(мСтатус) Тогда 
		Объект.Статус = мСтатус;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровДоговорПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокДоговоров.ТекущиеДанные;
	
	ОпределитьВестиПоДокументамРасчетов(ТекущиеДанные);
	ПолучитьОстаткиПоВзаиморасчетамУпр(ТекущиеДанные.Договор);
	ПолучитьОстаткиПоВзаиморасчетамРегл(ТекущиеДанные.Договор);
	
	УстановитьОтборПоДоговору(ТекущиеДанные.Договор);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровНовыйДоговорПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокДоговоров.ТекущиеДанные;
	
	ОпределитьВестиПоДокументамРасчетов(ТекущиеДанные);

	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокДоговоров.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьОтборПоДоговору(ТекущиеДанные.Договор);
		
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура Файлы(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Ответ = Вопрос("Для выполнения данной операции необходимо записать документ. Записать?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДляСпискаИзображдений = Новый Структура("ОтборОбъектИспользование, ОтборОбъектЗначение, ДоступностьОтбораОбъекта, ВидимостьКолонкиОбъекта", Истина, Объект.Ссылка, Ложь, Ложь);
	СтруктураДляСпискаДополнительныхФайлов = Новый Структура("ОтборОбъектИспользование, ОтборОбъектЗначение, ДоступностьОтбораОбъекта, ВидимостьКолонкиОбъекта", Истина, Объект.Ссылка, Ложь, Ложь);
	ОбязательныеОтборы = Новый Структура("Объект", Объект.Ссылка);
	
	РаботаСФайлами.ОткрытьФормуСпискаФайловИИзображений(СтруктураДляСпискаИзображдений, СтруктураДляСпискаДополнительныхФайлов, ОбязательныеОтборы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусов(Команда)
	
	ОткрытьФорму("РегистрСведений.абс_ИсторияСтатусовИзменениеКонтрагентаВДоговоре.ФормаСписка", Новый Структура("Документ", Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиБух(Команда)
	
	БухгалтерскийУчет.ОткрытьЖурналПроводок(Объект.КорректировкаДолга);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткиПоВзаиморасчетам(Команда)
	
	Для Каждого строка из Объект.СписокДоговоров Цикл 
		ПолучитьОстаткиПоВзаиморасчетамУпр(строка.Договор);
		ПолучитьОстаткиПоВзаиморасчетамРегл(строка.Договор);	
	КонецЦикла;
	
КонецПроцедуры


 ////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОпределитьВестиПоДокументамРасчетов(ТекущиеДанные)
		
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.НовыйДоговор) Тогда
		ТекущиеДанные.ВестиПоДокументамРасчетов = ТекущиеДанные.НовыйДоговор.ВестиПоДокументамРасчетовСКонтрагентом;	
	ИначеЕсли (ЗначениеЗаполнено(ТекущиеДанные.Договор)) И (НЕ ЗначениеЗаполнено(ТекущиеДанные.НовыйДоговор)) Тогда 
		ТекущиеДанные.ВестиПоДокументамРасчетов = ТекущиеДанные.Договор.ВестиПоДокументамРасчетовСКонтрагентом;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтрокиВзаиорасчетовПоДоговору(Договор)
	
	МассивСтрокПоДоговору = Объект.ВзаиморасчетыРегл.НайтиСтроки(Новый Структура("Договор", Договор));
	Для Каждого строка из МассивСтрокПоДоговору Цикл 
		Объект.ВзаиморасчетыРегл.Удалить(строка);
	КонецЦикла;
	
	МассивСтрокПоДоговору = Объект.ВзаиморасчетыУпр.НайтиСтроки(Новый Структура("Договор", Договор));	
	Для Каждого строка из МассивСтрокПоДоговору Цикл 
		Объект.ВзаиморасчетыУпр.Удалить(строка);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоДоговору(Договор)
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("Договор", Договор);
	Элементы.ВзаиморасчетыРегл.ОтборСтрок 	= ОтборСтрок; 
	Элементы.Взаиморасчеты.ОтборСтрок 		= ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Функция ВвестиСтрокуНаКлиенте()
	
	СтрокаВвода = "";
	ВвестиСтроку(СтрокаВвода,"Введите причину изменения статуса",,Истина);
	Возврат СтрокаВвода;
	
КонецФункции

 ////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ДоступнаРольИсполнителя(Роль, Организация)
  
  	РольДоступнаПользователю = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РолиИИсполнители.Роль
		|ИЗ
		|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
		|ГДЕ
		|	РолиИИсполнители.Исполнитель = &Исполнитель
		|	И РолиИИсполнители.Роль = &Роль
		|	И ВЫБОР
		|			КОГДА &ДЗО
		|				ТОГДА РолиИИсполнители.Организация = &Организация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";

	Запрос.УстановитьПараметр("Исполнитель", глЗначениеПеременной("глТекущийПользователь"));
	
	Если Роль = Справочники.РолиИсполнителей.ОтветственныйОСДЗО и ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("ДЗО",Истина);
	Иначе
		Запрос.УстановитьПараметр("ДЗО",Ложь);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Роль",Роль);

	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	РольДоступнаПользователю = Истина;
	//КонецЦикла;
	//
	//Возврат РольДоступнаПользователю;
	 
КонецФункции 

&НаСервере
Процедура ЗаполнитьСписокДоступныхСтатусов()
	
	Статус = Объект.Статус;
	Статусы = Перечисления.абс_СтатусыИзмененияКонтрагентаВДоговоре;
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Статус);
	РольСогласованиеБухгалетром = ДоступнаРольИсполнителя(Справочники.РолиИсполнителей.СогласованиеБухгалтеромППД, Объект.Организация); 
	
	Если НЕ Параметры.Ключ.Пустая() Тогда	
		
		Если Статус = Статусы.Подготовка Тогда
			МассивСтатусов.Добавить(Статусы.ОбработкаБухгалтерои);
		КонецЕсли;
		
		Если (Статус = Статусы.ОбработкаБухгалтерои) И РольСогласованиеБухгалетром Тогда
			МассивСтатусов.Добавить(Статусы.Завершен);
			МассивСтатусов.Добавить(Статусы.Отказ);
		КонецЕсли;

	КонецЕсли;
	
	Элементы.Статус.СписокВыбора.ЗагрузитьЗначения(МассивСтатусов);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиПоВзаиморасчетамУпр(Договор)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РегистрРассчетов.ДоговорКонтрагента КАК Договор,
	                      |	РегистрРассчетов.Документ,
	                      |	РегистрРассчетов.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	                      |	РегистрРассчетов.СуммаРегОстаток КАК СуммаРег,
	                      |	РегистрРассчетов.СчетОплаты,
	                      |	РегистрРассчетов.Сделка,
	                      |	РегистрРассчетов.ДатаОплаты
	                      |ИЗ
	                      |	РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации.Остатки(
	                      |			&Период,
	                      |			ДоговорКонтрагента = &Договор
	                      |				И Контрагент = &Контрагент
	                      |				И Организация = &Организация) КАК РегистрРассчетов");
		
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации",  "РасчетыПоРеализацииВУсловныхЕдиницахОрганизации"); 	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Контрагент", 	Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Период", 		Новый Граница(Объект.Дата, ВидГраницы.Исключая));
						  
	МассивСтрокПоДоговору = Объект.ВзаиморасчетыУпр.НайтиСтроки(Новый Структура("Договор", Договор));
	
	Для Каждого строка из МассивСтрокПоДоговору Цикл 
		Объект.ВзаиморасчетыУпр.Удалить(строка);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(Объект.ВзаиморасчетыУпр.Добавить(), Выборка);	
	КонецЦикла;
		
КонецФункции

&НаСервере
Функция ПолучитьОстаткиПоВзаиморасчетамРегл(Договор)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ХозрасчетныйОстатки.Счет КАК СчетОплаты,
	                      |	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	                      |	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаВзаиморасчетов,
	                      |	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаДт,
	                      |	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаКт
	                      |ИЗ
	                      |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	                      |			&Период,
	                      |			,
	                      |			&МассивСубконто,
	                      |			Организация = &Организация
	                      |				И Субконто2 = &Договор) КАК ХозрасчетныйОстатки");
						  
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос.УстановитьПараметр("Договор", 			Договор);
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	Запрос.УстановитьПараметр("МассивСубконто", 	МассивСубконто);
	Запрос.УстановитьПараметр("Период", 			Новый Граница(Объект.Дата, ВидГраницы.Исключая));
	
	МассивСтрокПоДоговору = Объект.ВзаиморасчетыРегл.НайтиСтроки(Новый Структура("Договор", Договор));
	
	Для Каждого строка из МассивСтрокПоДоговору Цикл 
		Объект.ВзаиморасчетыРегл.Удалить(строка);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(Объект.ВзаиморасчетыРегл.Добавить(), Выборка);	
	КонецЦикла;
		
КонецФункции

&НаСервере
Функция ПроверитьАктуальностьЗаполненияВзаиморасчетовНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ДокументОбъект.ПроверитьАктуальностьЗаполненияВзаиморасчетов();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьСтатусВРегистр(Ссылка, Статус, СтрокаПричиныИзмененияСтатуса)
		
	НаборЗаписей = РегистрыСведений.абс_ИсторияСтатусовИзменениеКонтрагентаВДоговоре.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период               = абс_СерверныеФункции.ПолучитьДатуСервера();
	
	Запись.Документ				= Ссылка;
	Запись.Исполнитель	 		= глЗначениеПеременной("глТекущийПользователь");	
	Запись.Статус 		   		= Статус;
	Запись.ВнутреннийНомер      = Запись.Исполнитель.абс_ВнутреннийНомер;
	
	Запись.Комментарий 			= СтрокаПричиныИзмененияСтатуса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
